blog/naming.html
<!DOCTYPE html>
<html>
<head>
<title>ディーサの名前，あるいはネーミングの難しさについて</title>
<!-- 2018-06-16 Sat 07:27 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/prelude.css" />
<link rel="stylesheet" type="text/css" href="/css/highlight.css" />
</head>
<body>
<div id="content">
<h1 class="title">ディーサの名前，あるいはネーミングの難しさについて</h1>
<div class="location">
<p>
https://<a href="/">bydriv.github.io</a>/<a href="/blog">blog</a>/<strong>naming.html</strong>
</p>

</div>

<div class="created_at">
<p>
created at <time datetime="2018-06-16">2018-06-16</time>
</p>

</div>

<div class="updated_at">
<p>
updated at <time datetime="2018-06-16">2018-06-16</time>
</p>

</div>

<p>
ディーサの名前はアイスランド語で Dísa Jónudóttir と書くのだが，
彼女の名前を設定するのはけっこうたいへんだった．
そのことでふと， 人名などを設定するのは想像よりずっとたいへんなのだということ，
そしてなぜたいへんなのかを記しておく．
</p>

<p>
まず， 具体例から入ろう． ディーサはアイスランド人の女性で，
Dísa Jónudóttir という． まず，彼女の名前の顕著な特徴は名字がないことである．
Jónudóttir が名字なのでは？　と思われるかたもいるかもしれない．
ところが，違うのである． これは <b>母称</b> (<i>matronymic</i>) と呼ばれるもので，名字とは異なるのである．
では，どう異なるのだろうか．
</p>

<p>
Jónudóttir を分解すると，
Jónu dóttir となる． dóttir は <b>娘</b> を意味するアイスランド語の単語である．
Jónu は Jóna の属格， 簡単にいえば所有格である．
つまり， Jónudóttir とは直訳すれば Jóna の娘，ということになる．
</p>

<p>
Jóna というのは女性の名前だから，つまり，ディーサの母親は Jóna という名前ということになる．
ディーサの祖母も Jóna という名前である場合を除いて，だが，
Jóna 自身は当然 Jóna の娘ではないから， 彼女は Jóna Xdóttir という名前ということになる．
X というのは， Jóna の母親， すなわちディーサの祖母の名前の属格である．
</p>

<p>
また，ここまで説明してこなかったが， X の部分に父親の名前が入る場合は
<b>父称</b> (<i>patronymic</i>)が使われ，むしろ，大半のアイスランド人は父称を使っている．
もちろん母称を使うひとも少なからずおり，理由はまあ，
たとえば単に父親の名前が不明な場合とか，いろいろある．
また，男性の場合は dóttir ではなくて son が使われ， Xson という名前になる．
エイリークの息子エリクソンが有名である．
</p>

<p>
つまり，夫婦別姓でなければ，だが，名字は基本的に家族全員がいっしょになるのに対し，
同じ父称や母称を使うのは兄弟や姉妹だけで，
父称や母称というのは世代，そして，性別ごとに変わるということになる．
兄妹や姉弟の場合，家族全員が異なる父称や母称を使うことになる．
</p>

<p>
属格の屈折についても理解しておかねばならない．
Jóna の属格は Jónu といった． したがって， Jónadóttir としてはならない．
ちなみに， Dísa の属格は Dísu なので， ディーサの娘は Dísudóttir ということになる．
もちろん，最後の a を u に置きかえればよいという単純なものではない．
たとえば Sigrún の属格は Sigrúnar となるので，
Sigrún の娘は Sigrúnardóttir となる．
</p>

<p>
つぎに，音写の問題がある．
まず，当然だが同じラテン文字を使う文化圏でも発音は異なる．
Dísa は比較的簡単だが， Jónudóttir というのをジョナドッティルのように読んではならない．
もちろん， すべて英語読みで音写してしまう，というのもひとつの手ではある．
しかしわたしはそうしたくはなかったので，
Jónudóttir はヨーヌドフテルと音写した．
J は音声記号と同様にヤ行の発音なのと，
アイスランド語では tt という並びを ht と読むので，
ドフテルとなっている．もちろん，カタカナで完璧に音写することはできないけども，
まあ，きもちとしてできるだけ元来の発音に近くなるようにしたつもりである．
</p>

<p>
ちなみに， rl は rtl と発音するので， Erla は Ertla という感じの発音になる．
じつは，命名するときにこういった発音の規則を徹底的に調べてわざとひと目見ただけではわからないような
難しい発音になるような名前を選んだ．
そのほうがべつの言語であるということをより表現できると思ったからである．
</p>

<p>
まあこういうふうに，外国人の名前をつけるということはその国の言語や命名の文化を調べる必要があるので，
けっこうたいへんということなのである．
たとえば，アイスランド人の有名人からとって ディーサ・ <b>エリクソン</b> などと命名しようものなら，
ディーサは男の娘ということになってしまう． このへんの話はロシア語でもそうで，
ロシア人の名前を適当にウィキペディアとかからとってくると女の子なのに男性の父称を名乗ってるという
へんてこなことになってしまう（勘違いしやすいが母称にすればよいということではなくて，
同じ父称号でも（父親の名前）～の息子と（父親の名前）～の娘で違うつづりや発音になるということ．
たとえばなんとかコフとかでよく見る～オフ (<i>-ov</i>)というのは～の息子を意味する接尾辞で
～の娘を意味するのは～オヴァ (<i>-ova</i>)になる．実際にはこんな単純ではなくてもっといろいろ複雑なのだが．
あと，ロシアではアイスランドと違ってたとえ父親がいなくても父称を名乗るのがふつうらしい）．
</p>

<p>
まあ，ただ単に命名するだけでも，ネーミングはけっこう知識が必要という話なのでした．
</p>
</div>
</body>
</html>
